## Pandas
type data series, dataframe
series=sebuah deret data
dataframe=2 dimensi array

In [1]:
import numpy as np
import pandas as pd
from functools import reduce
import statistics

In [2]:
pd.Series()

Series([], dtype: float64)

## Challange

In [3]:
a=np.random.randint(1000,2000,(5,12))
df=pd.DataFrame(a, columns=np.arange(1,13), index='screen mouse speaker keyboard VGA'.split())
df

,1,2,3,4,5,6,7,8,9,10,11,12
screen,1936,1643,1059,1190,1741,1382,1585,1606,1451,1028,1167,1050
mouse,1549,1114,1712,1440,1545,1220,1937,1811,1933,1737,1262,1807
speaker,1841,1631,1592,1454,1952,1013,1068,1341,1934,1527,1241,1661
keyboard,1921,1379,1076,1991,1365,1860,1201,1293,1544,1296,1090,1579
VGA,1393,1707,1247,1622,1360,1451,1338,1847,1149,1351,1981,1629

In [4]:
dfn=pd.DataFrame()
for i in df.columns:
    count=len(df[i])
    daft= list(df[i][:])
    mean= reduce(lambda a,b:a+b,daft)/count
    std= statistics.stdev(daft)
    mini=min(daft)
    maxi=max(daft)
    dfn[i]=list([count,mean,std,mini,maxi])
dfn[" "]='Count Mean STD min max'.split()
dfn.set_index(" ",inplace=True)
dfn

,1,2,3,4,5,6,7,8,9,10,11,12
,,,,,,,,,,,,
Count,5.000000,5.00000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.00000,5.00000,5.000000
Mean,1728.000000,1494.80000,1337.200000,1539.400000,1592.600000,1385.200000,1425.800000,1579.600000,1602.200000,1387.80000,1348.20000,1545.200000
STD,243.694481,246.96194,299.647626,295.812103,254.637586,314.483227,343.851276,257.300991,335.841778,264.83712,360.15927,289.541361
min,1393.000000,1114.00000,1059.000000,1190.000000,1360.000000,1013.000000,1068.000000,1293.000000,1149.000000,1028.00000,1090.00000,1050.000000
max,1936.000000,1707.00000,1712.000000,1991.000000,1952.000000,1860.000000,1937.000000,1847.000000,1934.000000,1737.00000,1981.00000,1807.000000

In [5]:
df.describe()

,1,2,3,4,5,6,7,8,9,10,11,12
count,5.000000,5.00000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.00000,5.00000,5.000000
mean,1728.000000,1494.80000,1337.200000,1539.400000,1592.600000,1385.200000,1425.800000,1579.600000,1602.200000,1387.80000,1348.20000,1545.200000
std,243.694481,246.96194,299.647626,295.812103,254.637586,314.483227,343.851276,257.300991,335.841778,264.83712,360.15927,289.541361
min,1393.000000,1114.00000,1059.000000,1190.000000,1360.000000,1013.000000,1068.000000,1293.000000,1149.000000,1028.00000,1090.00000,1050.000000
25%,1549.000000,1379.00000,1076.000000,1440.000000,1365.000000,1220.000000,1201.000000,1341.000000,1451.000000,1296.00000,1167.00000,1579.000000
50%,1841.000000,1631.00000,1247.000000,1454.000000,1545.000000,1382.000000,1338.000000,1606.000000,1544.000000,1351.00000,1241.00000,1629.000000
75%,1921.000000,1643.00000,1592.000000,1622.000000,1741.000000,1451.000000,1585.000000,1811.000000,1933.000000,1527.00000,1262.00000,1661.000000
max,1936.000000,1707.00000,1712.000000,1991.000000,1952.000000,1860.000000,1937.000000,1847.000000,1934.000000,1737.00000,1981.00000,1807.000000

# Removing Row and Col

In [6]:
kota = pd.DataFrame(data=np.array([[1,2,3], [4,5,6], [7,8,9]]),
                 index=('Jakarta', 'Bandung', 'Bekasi'),
                 columns='Januari Februari Maret'.split())
kota

         Januari  Februari  Maret
Jakarta        1         2      3
Bandung        4         5      6
Bekasi         7         8      9

In [7]:
kota['total']=kota['Januari']*kota['Maret']
kota

         Januari  Februari  Maret  total
Jakarta        1         2      3      3
Bandung        4         5      6     24
Bekasi         7         8      9     63

In [8]:
kota.drop('total',1)

         Januari  Februari  Maret
Jakarta        1         2      3
Bandung        4         5      6
Bekasi         7         8      9

# Selection

In [9]:
kota.iloc[2,2]

9

In [10]:
kota.loc["Jakarta", "Maret"]

3

In [11]:
kota.iloc[:2,:2]

         Januari  Februari
Jakarta        1         2
Bandung        4         5

In [12]:
kota.loc["Jakarta":"Bandung","Januari":"Februari"]

         Januari  Februari
Jakarta        1         2
Bandung        4         5

In [13]:
kota["Maret"][0]

3

In [14]:
kota.iloc[[0,2],[0,2]]

         Januari  Maret
Jakarta        1      3
Bekasi         7      9

In [15]:
kota.iloc[:1]
kota.iloc[[0]]

         Januari  Februari  Maret  total
Jakarta        1         2      3      3

In [16]:
kota.loc[['Jakarta']]

         Januari  Februari  Maret  total
Jakarta        1         2      3      3

## Conditional Selection

In [17]:
kota

         Januari  Februari  Maret  total
Jakarta        1         2      3      3
Bandung        4         5      6     24
Bekasi         7         8      9     63

In [18]:
kota>3

         Januari  Februari  Maret  total
Jakarta    False     False  False  False
Bandung     True      True   True   True
Bekasi      True      True   True   True

In [19]:
kota[kota['Januari']>3]

         Januari  Februari  Maret  total
Bandung        4         5      6     24
Bekasi         7         8      9     63

In [20]:
kota[kota['Januari']>3]["Januari"]

Bandung    4
Bekasi     7
Name: Januari, dtype: int32

In [21]:
kota[kota['Januari']>3][["Januari"]]

         Januari
Bandung        4
Bekasi         7

In [22]:
kota[(kota['Maret']>1)&(kota['Februari']>2)]

         Januari  Februari  Maret  total
Bandung        4         5      6     24
Bekasi         7         8      9     63

In [23]:
kota[(kota['Maret']>1)|(kota['Februari']>2)]

         Januari  Februari  Maret  total
Jakarta        1         2      3      3
Bandung        4         5      6     24
Bekasi         7         8      9     63

# Index Details

In [24]:
kota

         Januari  Februari  Maret  total
Jakarta        1         2      3      3
Bandung        4         5      6     24
Bekasi         7         8      9     63

In [25]:
kota2 = kota.reset_index()
kota2.rename({'index':'Kota'}, axis=1, inplace=True)
kota2

      Kota  Januari  Februari  Maret  total
0  Jakarta        1         2      3      3
1  Bandung        4         5      6     24
2   Bekasi        7         8      9     63

In [26]:
kota3=kota.reset_index(drop=True)

In [27]:
goods='smartphone laptop tablet'.split()
goods

['smartphone', 'laptop', 'tablet']

In [28]:
kota3['items']=goods
gadget= kota3.set_index('items')
gadget

            Januari  Februari  Maret  total
items
smartphone        1         2      3      3
laptop            4         5      6     24
tablet            7         8      9     63

# Multi Index and Index Hierarchy

In [29]:
area= (('jabodetabek '*3) + ('Outside '*3)).split()
district=[1,2,3,1,2,3]
hier_index=list(zip(area,district))
hier_index

[('jabodetabek', 1),
 ('jabodetabek', 2),
 ('jabodetabek', 3),
 ('Outside', 1),
 ('Outside', 2),
 ('Outside', 3)]

In [30]:
multi_index=pd.MultiIndex.from_tuples(hier_index)
multi_index

MultiIndex([('jabodetabek', 1),
            ('jabodetabek', 2),
            ('jabodetabek', 3),
            (    'Outside', 1),
            (    'Outside', 2),
            (    'Outside', 3)],
           )

In [31]:
sales=pd.DataFrame({'Smartphone':np.random.randint(1000,2000,6), 'PC':np.random.randint(1000,2000,6)}, index=multi_index)
sales

               Smartphone    PC
jabodetabek 1        1150  1134
            2        1517  1043
            3        1267  1419
Outside     1        1276  1983
            2        1395  1241
            3        1514  1836

In [32]:
sales.loc['jabodetabek']
sales.iloc[:3]

               Smartphone    PC
jabodetabek 1        1150  1134
            2        1517  1043
            3        1267  1419

In [33]:
sales

               Smartphone    PC
jabodetabek 1        1150  1134
            2        1517  1043
            3        1267  1419
Outside     1        1276  1983
            2        1395  1241
            3        1514  1836

In [34]:
sales.loc['jabodetabek'][sales['PC']['jabodetabek']==sales['PC']['jabodetabek'].max()]

   Smartphone    PC
3        1267  1419

In [35]:
sales.loc['jabodetabek'][sales.loc['jabodetabek']['Smartphone']==sales.loc['jabodetabek']['Smartphone'].max()]

   Smartphone    PC
2        1517  1043

In [36]:
sales['PC'][[2]]

jabodetabek  3    1419
Name: PC, dtype: int32

# Import Data
### csv

In [37]:
pegawai_csv=pd.read_csv('data_pegawai.csv', delimiter=';',skiprows=2,skipfooter=2)
#delimiter untuk menentukan pembatas, skiprows untuk melewati beberapa baris di atas, skipfooter untuk melewati beberapa garis di bawah
pegawai_csv.set_index('no.')
pegawai_csv[['nama','gaji']]

   nama      gaji
0  andi  11000000
1  budi  15000000
2  caca  15000000
3  deni  12000000
4  euis  14000000

### Excel

In [38]:
pegawai_xls=pd.read_excel('data_pegawai.xlsx',skiprows=3, skipfooter=2)
pegawai_xls

   no.  nama  usia      kota      gaji
0    1  andi    22   jakarta  11000000
1    2  budi    28   jakarta  15000000
2    3  caca    21   bandung  15000000
3    4  deni    29  semarang  12000000
4    5  euis    35   bandung  14000000

In [39]:
pegawai_csv.describe()
pegawai_csv['no.'].dtype

dtype('int64')

In [40]:
pegawai_type=pd.DataFrame()

for i in range(len(pegawai_csv.columns)):
    nn=f'{len(pegawai_csv)-pegawai_csv[pegawai_csv.columns[i]].isna().sum()} non-null'
    dty=pegawai_csv[pegawai_csv.columns[i]].dtype
    pegawai_type[i]=[pegawai_csv.columns[i],nn,dty]
hasil=pegawai_type.transpose()
hasil.rename({0:'Column',1:'Non-Null Count',2:'Dtype'},axis=1,inplace=True)
hasil

  Column Non-Null Count   Dtype
0    no.     5 non-null   int64
1   nama     5 non-null  object
2   usia     5 non-null   int64
3   kota     5 non-null  object
4   gaji     5 non-null   int64

In [41]:
c=sorted(pegawai_csv['gaji'],reverse=True)
pegawai_csv[['nama','gaji']][pegawai_csv['gaji']>=c[2]]

   nama      gaji
1  budi  15000000
2  caca  15000000
4  euis  14000000

# dealing with missing data

In [42]:
df=pd.DataFrame({'Jakarta':[100,200,np.nan,400],
'Bandung': [500,np.nan,np.nan,1000], 'Bekasi': [100,200,300,500]})
df.describe()

          Jakarta      Bandung      Bekasi
count    3.000000     2.000000    4.000000
mean   233.333333   750.000000  275.000000
std    152.752523   353.553391  170.782513
min    100.000000   500.000000  100.000000
25%    150.000000   625.000000  175.000000
50%    200.000000   750.000000  250.000000
75%    300.000000   875.000000  350.000000
max    400.000000  1000.000000  500.000000

In [43]:
df

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100
1    200.0      NaN     200
2      NaN      NaN     300
3    400.0   1000.0     500

In [44]:
df.isna().sum()/len(df)*100

Jakarta    25.0
Bandung    50.0
Bekasi      0.0
dtype: float64

# Metode Dropping NA Values:
1. dilihat dulu presentase kehilangan datanya pada tiap kolom.
2. kalau dalam 1 kolom terdapat missing data >50% dari total data, maka kita boleh menghapus kolom tersebut.
3. kalau tidak ada kolom yang missing datanya >50% kita bisa mengisi datanya dengan mean, median, modus, ataupun nilai sebelum/sesudahnya (front fill atau back fill), atau dengan menggunakan metode linear regresi atau metode lainnya.
** untuk penggunaan modus,mean,median dengan normaliti tes.**
- menghapus data tersebut berdasarkan barisnya(row)
4. solusi yang terbaik adalah dengan refill dengan percobaan menghasilkan analisis yang terbaik.

Data yang terdistribusi normal adalah yang menggunung di tengah menggunakan mean
jika data yang terdistribusi secara skew maka lebih baik menggunakan median

<img src="catatan.png">

## Dropna() : Menghapus data Kosong

In [45]:
df

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100
1    200.0      NaN     200
2      NaN      NaN     300
3    400.0   1000.0     500

In [46]:
df.dropna()
#menghapus semua data nan di baris walaupun hanya 1

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100
3    400.0   1000.0     500

In [47]:
df.dropna(axis=1)
#menghapus semua data nan di kolom walaupun hanya 1

   Bekasi
0     100
1     200
2     300
3     500

In [48]:
df.dropna(thresh=1)
#menghapus baris yang memiliki jumlah data minimal {1}

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100
1    200.0      NaN     200
2      NaN      NaN     300
3    400.0   1000.0     500

In [49]:
df.dropna(axis=1,thresh=2)
#menghapus kolom yang miliki jumlah data minimal {2}

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100
1    200.0      NaN     200
2      NaN      NaN     300
3    400.0   1000.0     500

In [50]:
def most_na(x=pd.DataFrame,axis=1):
    result=''
    # for i in x.columns:
            
df.drop('Bandung',axis=1)
#menghapus kolom yang memiliki jumlah nan >50%

   Jakarta  Bekasi
0    100.0     100
1    200.0     200
2      NaN     300
3    400.0     500

## Fillna() : Mengisi Kekosongan Variabel

In [51]:
df.fillna(value=300)
#semua nan akan berubah menjadi value

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100
1    200.0    300.0     200
2    300.0    300.0     300
3    400.0   1000.0     500

In [52]:
df['Jakarta'].fillna(value=df['Jakarta'].mean())
#mengisi value na {Jakarta} dengan rata-rata di {Jakarta}

0    100.000000
1    200.000000
2    233.333333
3    400.000000
Name: Jakarta, dtype: float64

In [53]:
df['Bandung'].fillna(value=df['Bandung'].mean())
#mengisi value na {bandung} dengan rata-rata di {Bandung}

0     500.0
1     750.0
2     750.0
3    1000.0
Name: Bandung, dtype: float64

In [54]:
df['Jakarta'].fillna(method='ffill')
#Method ffill akan mengisi na dengan data sebelumnya

0    100.0
1    200.0
2    200.0
3    400.0
Name: Jakarta, dtype: float64

In [55]:
df['Bandung'].fillna(method='bfill')
#Method bfill akan mengisi na dengan data sesudah NA.

0     500.0
1    1000.0
2    1000.0
3    1000.0
Name: Bandung, dtype: float64

## Replace()
mengganti variabel nan dengan value tertentu

In [56]:
df.replace(np.nan,'-')

  Jakarta Bandung  Bekasi
0     100     500     100
1     200       -     200
2       -       -     300
3     400    1000     500

In [57]:
df2=df.replace(np.nan,'-')
df2.info()
#jebakan karena dtype object yang harusnya int64

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Jakarta  4 non-null      object
 1   Bandung  4 non-null      object
 2   Bekasi   4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [58]:
df2.replace(['-','#'], [1,2])
#mengganti >2 karaktek gunakan list value {2}

   Jakarta  Bandung  Bekasi
0    100.0    500.0     100
1    200.0      1.0     200
2      1.0      1.0     300
3    400.0   1000.0     500

# Groupby

In [59]:
data = {
    'Perusahaan' : ['Ayam', 'Ayam', 'Mie', 'Mie', 'Pizza', 'Pizza'],
    'Karyawan' : ['Andi', 'Budi', 'Caca', 'Deni', 'Edi', 'Ferdi'],
    'Penjualan': [300, 200, 100, 500, 600, 450]
}
perusahaan=pd.DataFrame(data)
perusahaan

  Perusahaan Karyawan  Penjualan
0       Ayam     Andi        300
1       Ayam     Budi        200
2        Mie     Caca        100
3        Mie     Deni        500
4      Pizza      Edi        600
5      Pizza    Ferdi        450

In [60]:
company = perusahaan.groupby('Perusahaan')

In [61]:
company.mean()

            Penjualan
Perusahaan
Ayam              250
Mie               300
Pizza             525

In [62]:
company.get_group('Ayam')

  Perusahaan Karyawan  Penjualan
0       Ayam     Andi        300
1       Ayam     Budi        200

In [63]:
company.groups

{'Ayam': Int64Index([0, 1], dtype='int64'),
 'Mie': Int64Index([2, 3], dtype='int64'),
 'Pizza': Int64Index([4, 5], dtype='int64')}

### Akhir Batas Groupby

In [64]:
test_score=pd.DataFrame({'nama':' andi andi andi budi budi budi'.split(),'fisika': [90,95,92,90,88,80],'biologi': [78,80,82,95,88,80]})
test_score

   nama  fisika  biologi
0  andi      90       78
1  andi      95       80
2  andi      92       82
3  budi      90       95
4  budi      88       88
5  budi      80       80

In [65]:
byName= test_score.groupby('nama')
byName.mean()

         fisika    biologi
nama
andi  92.333333  80.000000
budi  86.000000  87.666667

In [66]:
byName.median()

      fisika  biologi
nama
andi      92       80
budi      88       88

In [67]:
byName.std()

        fisika   biologi
nama
andi  2.516611  2.000000
budi  5.291503  7.505553

In [68]:
byName.get_group('andi')['fisika']

0    90
1    95
2    92
Name: fisika, dtype: int64

In [69]:
byName.get_group('budi').max()

nama       budi
fisika       90
biologi      95
dtype: object

In [70]:
test_score.mean()

fisika     89.166667
biologi    83.833333
dtype: float64

# Concat

In [71]:
test_score2 = pd.DataFrame({'nama': 'didi euis fafa didi euis fafa'.split(),
'math':[90,95,92,90,88,80], 'biologi':[78,80,85,95,98,90]})
test_score2

   nama  math  biologi
0  didi    90       78
1  euis    95       80
2  fafa    92       85
3  didi    90       95
4  euis    88       98
5  fafa    80       90

In [72]:
pd.concat([test_score,test_score2], ignore_index=True)
#ignore index agar index tidak berulang

    nama  fisika  biologi  math
0   andi    90.0       78   NaN
1   andi    95.0       80   NaN
2   andi    92.0       82   NaN
3   budi    90.0       95   NaN
4   budi    88.0       88   NaN
5   budi    80.0       80   NaN
6   didi     NaN       78  90.0
7   euis     NaN       80  95.0
8   fafa     NaN       85  92.0
9   didi     NaN       95  90.0
10  euis     NaN       98  88.0
11  fafa     NaN       90  80.0

In [73]:
pd.concat([test_score,test_score2], axis=1)

   nama  fisika  biologi  nama  math  biologi
0  andi      90       78  didi    90       78
1  andi      95       80  euis    95       80
2  andi      92       82  fafa    92       85
3  budi      90       95  didi    90       95
4  budi      88       88  euis    88       98
5  budi      80       80  fafa    80       90

In [74]:
pd.concat([test_score,test_score2], axis=1,join='inner')

   nama  fisika  biologi  nama  math  biologi
0  andi      90       78  didi    90       78
1  andi      95       80  euis    95       80
2  andi      92       82  fafa    92       85
3  budi      90       95  didi    90       95
4  budi      88       88  euis    88       98
5  budi      80       80  fafa    80       90

# Merge

In [77]:
kiri = pd.DataFrame({
    'kunci' : ['A', 'B', 'C', 'D'],
    'Jakarta': [1, 2, 3, 4],
    'BSD': [5, 6, 7, 8]
})

kanan = pd.DataFrame({
    'kunci' : ['A', 'B', 'C', 'D'],
    'Bekasi': [1, 2, 3, 4],
    'Bandung': [5, 6, 7, 8]
})

In [79]:
pd.merge(kiri,kanan,how='inner',on='kunci')

  kunci  Jakarta  BSD  Bekasi  Bandung
0     A        1    5       1        5
1     B        2    6       2        6
2     C        3    7       3        7
3     D        4    8       4        8

# Join

In [80]:
Budi = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                   index = ['K0', 'K1', 'K2'])

Andi = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                     'D': ['D0', 'D2', 'D3']},
                   index = ['K0', 'K2', 'K3'])

In [82]:
Budi.join(Andi)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

# Pivot

In [83]:
df_dummy = pd.DataFrame([
    {'test':1, 'nama':'Andi', 'fisika':90, 'biologi':78},
    {'test':2, 'nama':'Andi', 'fisika':95, 'biologi':80},
    {'test':3, 'nama':'Andi', 'fisika':90, 'biologi':82},
    {'test':1, 'nama':'Budi', 'fisika':80, 'biologi':80},
    {'test':2, 'nama':'Budi', 'fisika':85, 'biologi':89},
    {'test':3, 'nama':'Budi', 'fisika':72, 'biologi':75},])
df_dummy

   test  nama  fisika  biologi
0     1  Andi      90       78
1     2  Andi      95       80
2     3  Andi      90       82
3     1  Budi      80       80
4     2  Budi      85       89
5     3  Budi      72       75

In [127]:
df_dummy_pivot=df_dummy.pivot('test','nama')
df_dummy_pivot

     fisika      biologi
nama   Andi Budi    Andi Budi
test
1        90   80      78   80
2        95   85      80   89
3        90   72      82   75

In [129]:
df_dummy_pivot2=df_dummy.pivot('nama','test')
df_dummy_pivot2

     fisika         biologi
test      1   2   3       1   2   3
nama
Andi     90  95  90      78  80  82
Budi     80  85  72      80  89  75